{"experience_assessment": "I do not know much about this area.", "rating": "1: Reject", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "title": "Official Blind Review #4", "review": "This paper considers the problem of changing environments for LQR. The authors model this through the use of a decoder that maps an incoming context (C,D) to the LQR matrices (A,B). They provide an algorithm for this setting based on a UCB strategy, prove sample complexity and regret bounds, and experimental results.\n\nOverall the paper was well written but I had several concerns.\n\n1. The results of this paper were not contrasted with other papers in this area. For example, if C,D are constant, and \\Theta_* is a Block diagonal matrix with A,B on the diagonal - then the contextual case reduces to the standard LQR problem. It's unclear how the results given compare to past results in this setting, for example those of Abbasi-Yadkori/Szepesvari 2011.\n\n2. I did not fully understand the UCB nature of the algorithm. In each round \\Theta^(k) (the least squares estimator) seems to be used to compute the optimal policy (line 10 of the algorithm) instead \\tilde{\\Theta}^(k)  -the optimistic estimate. The optimistic estimate is only used in line 16 - a randomized procedure that is unmotivated.\n\n3. Building on (1), it is hard to understand the results as given since there are no lower bounds given nor is there a discussion of the problem dependent parameters that arise. For example, in Theorem 1, is dp^2 suspected to be tight? Since the number of parameters in \\Theta^{\\ast} is d(p+p'), perhaps this is off by a factor of p?\n\n3. I struggled to understand the setup of the experiments - as described the algorithm given was not used at all, rather \\Theta^(k) was approximated and beta^k was set to be a constant. This does not seem like a fair evaluation of the method. \n\nIn summary, I would reject this submission unless the authors couch it better in past work, explain their results better, and improve the experiment setup.\n\nFinally, a typo: I think the indexing variable in the equation on the top of page 4 is h' not h. \n", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory."}