{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "title": "Official Blind Review #1", "review": "This paper proposes solving the video summarization problem with a knapsack constraint using ILS. They also proposes a new benchmark dataset for this task. Overall, i have many concerns about this paper:\n\nThe connection from video summarization to ILS is novel. However, as it is unwritten, it is unclear what further contribution this paper introduces, and it seems like the novelty ends here. Regarding the ILS parameters defined in the paper - such as perturbation function, acceptance criteria, etc. - did the authors propose any novel mechanisms that exploit structure within the video summarization problem to deliver better performance over standard ILS techniques? Currently it is unclear whether the considered mechanisms are standard for the ILS framework or not. If they are standard, could the authors explain why other strategies weren't considered?\nThere is a lack of experimental evaluation. The authors cite numerous related work; however, Tables 1 and 2 include only the authors' own baselines. While this ablation study is useful, the performance of the proposed method cannot be accurately characterized without evaluation on the complete field of related work cited in the paper.\nThe proposed MIP baseline is weak - PuLP is a modeling language, not a solver. Which solver did you use? There is a order of magnitude difference between free ones and commercial ones.\n\nDue to the 1) seemingly limited novelty and 2) subpar experimental evaluation, I vote to reject this paper. If these concerns are thoroughly addressed, I would be happy to increase my score.\n\nAnother concern I have (that did not influence the decision in my review): the proposed method assumes given the chopped shots of a video. Does prior work make a similar assumption as well? It seems as if there could be large gains made by learning a good way to chop/trim shots along with the shot selection itself. For example, if a given shot is 5 seconds long, but only 3 seconds of it is actually useful, it seems suboptimal to have to either include the whole 5 seconds or exclude it.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory."}