{"experience_assessment": "I have published one or two papers in this area.", "rating": "6: Weak Accept", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "title": "Official Blind Review #4", "review": "This paper departs from traditional age estimation methods by proposing an ordering/ranking way. A testing face is compared to those anchor faces from each age category to estimate the right category that the testing face belongs to. It is novel to use the MC rule to drive the order learning. What more promising is the unsupervised chains, which could automatically search for a more optimal multi-chain division scheme than the pre-defined data division. The paper is well written.\n\nI have a few concerns as the following:\n1.\tThe geometric ratio (Eq. 10) further enlarges the distance between younger faces and shortens the distance between older faces. This may improve the prediction of younger ages. However, this makes the prediction on older ages more confusion, i.e., too robust to distinguish adjacent categories. The results shown in Table 6 show a better number for Geometric, but it is tested on FG-NET which presents unbalanced age distribution (ages up to 40 years are the most populated). Therefore, the improvement may be caused by the data distribution that is more suitable for geometric ratio, i.e., more younger faces and less older faces. Table 8 also provides such comparison, but please clarify the testing dataset. \n2.\tIn Algorithm 1, are you using a pre-trained comparator? If not, the T_k obtained from line 3 is still close to random. Such random initialization works for multiple chains with small mutual shift (the distance of references between chains). As indicated in Table 3, more chains will not significantly affect performance, which implies a relatively small mutual shift. However, if encounter a large shift, e.g., other properties would significantly affect the target property that you want to classify (ranking soccer teams where gender makes difference), will the proposed unsupervised learning converge? \n3.\tIt would be great if the authors could provide more insight to the 2CH unsupervised results. How the two chains are divided by analyzing the trained model? What is the key to divide the data? Maybe, it is like a black-box that is hard to explain but this will not affect the merit of this paper.\n ", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory."}